
// // 문제1) 입력받은 수 만큼 * 출력 
let output1 = ""
let num1 = Number(prompt("문제1 : 숫자를 입력하세요!")) 
for(i=1; i<=num1; i++){
    output1 += '*'
}
console.log(output1);


// // 문제2) 입력받은 수 만큼 * 출력 [  - 3줄(3배수)마다 줄바꿈 ]
let output2 = ""
let num2 = Number(prompt("문제2 : 숫자를 입력하세요!"))
for(i=1; i<=num2; i++){
    if(i%3==0){ output2 += '*\n'}
    else{ output2 += '*'}
}
console.log(output2);

// // 문제3) 입력받은 줄 수 만큼 * 출력  [ ex) 5 ]
// *
// **         
// ***      
// ****   
// *****
let output3 = ""
let num3 = Number(prompt("문제3 : 숫자를 입력하세요!"))
for(i=1; i<=num3; i++){
    for(j=1; j<i+1 ; j++){
        output3 += '*'
    }
    output3 += '\n'
}
console.log(output3);


// // 문제4) 입력받은 줄 수 만큼 * 출력 [ ex) 5 ]
// *****
// ****
// ***
// **
// *
let output4 = ""
let num4 = Number(prompt("문제4 : 숫자를 입력하세요!"))
for(i=1; i<=num4; i++){
    for(j=num4; j>=i; j--){
        output4 += '*'
    }
    output4 += '\n'
}
console.log(output4)

// // 문제5) 입력받은 줄 수 만큼 * 출력  [ ex) 5 ]
//     *
//    **
//   ***
//  ****
// *****
// // 문제6) 입력받은 줄 수 만큼 * 출력  [ ex) 5 ]
// *****
//  ****
//   ***
//    **
//     *
// // 문제7) 입력받은 줄 수 만큼 * 출력  [ ex) 5 ]
//     *
//    ***
//   *****
//  *******
// *********
// // 문제8) 입력받은 줄 수 만큼 * 출력  [ ex) 5 ]
// *********
//  *******
//   *****
//    ***
//     *
// // 문제9) 입력받은 줄 수 만큼 * 출력  [ ex) 10 ]
//     *
//    ***
//   *****
//  *******
// *********
// *********
//  *******
//   *****
//    ***
//     *
// // 문제10) 입력받은 줄 수 만큼 * 출력  [ ex) 7 ]
// *     *
//  *   *
//   * *
//    *
//   * *
//  *   *
// *     *
